function showLab1() {
    const text = `<h1>Лабораторна робота №1</h1>
                <div class="navlab1">
                    <a onclick="description()">Опис</a>
                    <a onclick="meta()">Тема Мета</a>
                    <a onclick="tableRes()">Таблиця</a>
                    <a onclick="image()">Зображення</a>
                    <a onclick="formCheck()">Форма</a>
                    <a onclick="itog()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}

function showLab2() {
    const text = `<h1>Лабораторна робота №2</h1>
                <div class="navlab1">
                    <a onclick="description_2()">Опис</a>
                    <a onclick="meta_2()">Тема Мета</a>
                    <a onclick="lists()">Списки</a>
                    <a onclick="identifiers()">Ідентифікатори</a>
                    <a onclick="indents()">Відступи</a>
                    <a onclick="floatingElements()">Плаваючі елементи</a>
                    <a onclick="selectorsClassTag()">Селектори тегу і класу</a>
                    <a onclick="selectorsOther()">Інші селектори</a>
                    <a onclick="selectorsGrouping()">Групування селекторів</a>
                    <a onclick="itog_2()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}

function showLab3() {
    const text = `<h1>Лабораторна робота №3</h1>
                <div class="navlab1">
                    <a onclick="description_2()">Опис</a>
                    <a onclick="meta_3()">Тема Мета</a>
                    <a onclick="bohdan()">Богдан</a>
                    <a onclick="misha()">Міша</a>
                    <a onclick="denys()">Денис</a>
                    <a onclick="vlad()">Влад</a>
                    <a onclick="mainsite()">Сайт</a>
                    <a onclick="itog_3()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}

function showLab4() {
    const text = `<h1>Лабораторна робота №4</h1>
                <div class="navlab1">
                    <a onclick="description_2()">Опис</a>
                    <a onclick="meta_4()">Тема Мета</a>
                    <a onclick="bohdan4()">Богдан</a>
                    <a onclick="misha4()">Міша</a>
                    <a onclick="denys4()">Денис</a>
                    <a onclick="vlad4()">Влад</a>
                    <a onclick="mainsite4()">Сайт</a>
                    <a onclick="itog_4()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}

function showLab5() {
    const text = `<h1>Лабораторна робота №5</h1>
                <div class="navlab1">
                    <a onclick="description_2()">Опис</a>
                    <a onclick="meta_5()">Тема Мета</a>
                    <a onclick="dinamic5()">Динамічні елементи 3 пункту</a>
                    <a onclick="foto5()">Фотогалерея</a>
                    <a onclick="slider5()">Слайдер фотографій</a>
                    <a onclick="fideo5()">Слайдер відеоматеріалів</a>
                    <a onclick="buttons5()">Кнопки соціальних мереж та Інформери</a>
                    <a onclick="task7()">Пункт 7</a>
                    <a onclick="itog_5()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}

function showLab6() {
    const text = `<h1>Лабораторна робота №6</h1>
                <div class="navlab1">
                    <a onclick="description_2()">Опис</a>
                    <a onclick="meta_6()">Тема Мета</a>
                    <a onclick="dinamic()">Динамічні елементи</a>
                    <a onclick="php()">Php завдання</a>
                    <a onclick="itog_6()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}

function showLab7() {
    const text = `<h1>Лабораторна робота №7</h1>
                <div class="navlab1">
                    <a onclick="description_2()">Опис</a>
                    <a onclick="meta_7()">Тема Мета</a>
                    <a onclick="mishaDB()">Завдання Мішані</a>
                    <a onclick="denysDB()">Завдання Дениса</a>
                    <a onclick="mishaDB()">Завдання Мішані</a>
                    <a onclick="mishaDB()">Завдання Мішані</a>
                    <a onclick="itog_7()">Висновок</a>
                </div>
                <div class="lab" id="context1" style="margin-top:20px">
                <h1>Спортивний комплекс</h1><p>
Користувач при переході на сайт спортивного комплексу, може зареєструватися або увійти в профіль. Після того як клієнт зареєструвався і увійшов у свій профіль, він може переглянути ціни абонементу в спортзал та басейн і також придбати якийсь із запропонованих, а також записатися на тренування. Користувач може переглянути фото спортивного комплексу, персонал, а також відгуки клієнтів і може залишити свій. На сайті також можна переглянути досягнення тренерів і клієнтів.
</p>
                </div>`;
    change(text)
}
